; domain
(define (domain hanoi) ;clear
  (:requirements :strips)
  (:predicates
    (onTopOfPeg ?disk ?peg)
    (onDisk ?disk1 ?disk2)
    (smaller ?disk1 ?disk2)
    (isDisk ?disk)
    (isPeg ?peg)
    (isPegFree ?peg)
    (isBottom ?disk ?peg)
    (arc ?peg1 ?peg2)
  )
  
  (:action moveFromDiskOnDisk ;c
    :parameters (?disk_top ?disk_under ?new_disk_under ?source_peg ?destination_peg) ;c
    :precondition (and
        (arc ?source_peg ?destination_peg)
    
        (isDisk ?disk_top) ;c
        (isDisk ?disk_under) ;c
        (isDisk ?new_disk_under) ;c
        
        (isPeg ?source_peg) ;c
        (isPeg ?destination_peg) ;c
        
        (onDisk ?disk_top ?disk_under) ;c
        (onTopOfPeg ?disk_top ?source_peg) ;c
        (onTopOfPeg ?new_disk_under ?destination_peg) ;c
    
        (smaller ?disk_top ?new_disk_under) ;c
    )
    :effect (and
        (not (onDisk ?disk_top ?disk_under)) ;c
        (not (onTopOfPeg ?new_disk_under ?destination_peg)) ;c
        (not (onTopOfPeg ?disk_top ?source_peg)) ;c
        
        (onTopOfPeg ?disk_under ?source_peg) ;c
        (onTopOfPeg ?disk_top ?destination_peg) ;c
        (onDisk ?disk_top ?new_disk_under) ;c
    )
  )
  
  (:action moveFromDiskOnEmptyTower ;c
    :parameters (?disk_top ?disk_under ?source_peg ?destination_peg)
    :precondition (and
        (arc ?source_peg ?destination_peg)
    
        (isDisk ?disk_top) ;c
        (isDisk ?disk_under) ;c
        
        (isPeg ?source_peg) ;c
        (isPeg ?destination_peg) ;c
        
        (isPegFree ?destination_peg) ;c

        (onDisk ?disk_top ?disk_under) ;c
        (onTopOfPeg ?disk_top ?source_peg) ;c
    )
    :effect (and
        (not (isPegFree ?destination_peg)) ;c
        (not (onDisk ?disk_top ?disk_under)) ;c
        (not (onTopOfPeg ?disk_top ?source_peg)) ;c
        
        (onTopOfPeg ?disk_under ?source_peg) ;c
        (isBottom ?disk_top ?destination_peg) ;c
        (onTopOfPeg ?disk_top ?destination_peg) ;c
    )
  )
  
  (:action moveFromEmptyTowerToDisk ;c
    :parameters (?disk_top ?new_disk_under ?source_peg ?destination_peg)
    :precondition (and
        (arc ?source_peg ?destination_peg)

        (isDisk ?disk_top) ;c
        (isDisk ?new_disk_under) ;c
        
        (isPeg ?source_peg) ;c
        (isPeg ?destination_peg) ;c
        
        (onTopOfPeg ?disk_top ?source_peg) ;c
        (onTopOfPeg ?new_disk_under ?destination_peg) ;c
        
        (isBottom ?disk_top ?source_peg) ;c
        
        (smaller ?disk_top ?new_disk_under) ;c
    )
    :effect (and
        (not (isBottom ?disk_top ?source_peg)) ;c
        (not (onTopOfPeg ?disk_top ?source_peg)) ;c
        (not (onTopOfPeg ?new_disk_under ?destination_peg)) ;c
        
        (onTopOfPeg ?disk_top ?destination_peg) ;c
        (isPegFree ?source_peg) ;c
        (onDisk ?disk_top ?new_disk_under) ;c
    )
  )
  
  (:action moveFromEmptyTowerOnEmptyTower ;c
    :parameters (?disk_top ?source_peg ?destination_peg)
    :precondition (and
        (arc ?source_peg ?destination_peg)

        (isDisk ?disk_top) ;c
        
        (isPeg ?source_peg) ;c
        (isPeg ?destination_peg) ;c
        
        (isPegFree ?destination_peg) ;c
        
        (onTopOfPeg ?disk_top ?source_peg) ;c
        (isBottom ?disk_top ?source_peg) ;c
    )
    :effect (and
        (not (isPegFree ?destination_peg)) ;c
        (not (isBottom ?disk_top ?source_peg)) ;c
        (not (onTopOfPeg ?disk_top ?source_peg)) ;c
        
        (isPegFree ?source_peg) ;c
        (isBottom ?disk_top ?destination_peg) ;c
        (onTopOfPeg ?disk_top ?destination_peg) ;c
    )
  )
)

; problem
(define (problem hanoi-5) ;problem definition for 5 disks
  (:domain hanoi)
  (:objects
    disk1 disk2 disk3 disk4 disk5
    peg1 peg2 peg3
  )
  (:init
    (arc peg1 peg2)
    (arc peg2 peg1)
    (arc peg1 peg3)
    (arc peg3 peg1)
    (arc peg2 peg3)
    (arc peg3 peg2)
  
    (isDisk disk1)
    (isDisk disk2)
    (isDisk disk3)
    (isDisk disk4)
    (isDisk disk5)
    
    (isPeg peg1)
    (isPeg peg2)
    (isPeg peg3)
    
    (smaller disk1 disk2)
    (smaller disk1 disk3)
    (smaller disk1 disk4)
    (smaller disk1 disk5)
    (smaller disk2 disk3)
    (smaller disk2 disk4)
    (smaller disk2 disk5)
    (smaller disk3 disk4)
    (smaller disk3 disk5)
    (smaller disk4 disk5)
    
    (onTopOfPeg disk1 peg1)
    (onDisk disk1 disk2)
    (onDisk disk2 disk3)
    (onDisk disk3 disk4)
    (onDisk disk4 disk5)
    (isBottom disk5 peg1)
    
    (not (isPegFree peg1))
    (isPegFree peg2)
    (isPegFree peg3)
  )
    (:goal (and
        (isPegFree peg1)
        (isPegFree peg2)
        (onTopOfPeg disk1 peg3)
        (onDisk disk1 disk2)
        (onDisk disk2 disk3)
        (onDisk disk3 disk4)
        (onDisk disk4 disk5)
        (isBottom disk5 peg3)
        )
    )
)

; plan
1. (movefromdiskonemptytower disk1 disk2 peg1 peg3)
   deleted: (ispegfree peg3) (ondisk disk1 disk2) (ontopofpeg disk1 peg1)
   added: (ontopofpeg disk2 peg1) (isbottom disk1 peg3) (ontopofpeg disk1 peg3)
   goals met: 5 of 8
2. (movefromdiskonemptytower disk2 disk3 peg1 peg2)
   deleted: (ispegfree peg2) (ondisk disk2 disk3) (ontopofpeg disk2 peg1)
   added: (ontopofpeg disk3 peg1) (isbottom disk2 peg2) (ontopofpeg disk2 peg2)
   goals met: 3 of 8
3. (movefromemptytowertodisk disk1 disk2 peg3 peg2)
   deleted: (isbottom disk1 peg3) (ontopofpeg disk1 peg3) (ontopofpeg disk2 peg2)
   added: (ontopofpeg disk1 peg2) (ispegfree peg3) (ondisk disk1 disk2)
   goals met: 3 of 8
4. (movefromdiskonemptytower disk3 disk4 peg1 peg3)
   deleted: (ispegfree peg3) (ondisk disk3 disk4) (ontopofpeg disk3 peg1)
   added: (ontopofpeg disk4 peg1) (isbottom disk3 peg3) (ontopofpeg disk3 peg3)
   goals met: 2 of 8
5. (movefromdiskondisk disk1 disk2 disk3 peg2 peg3)
   deleted: (ondisk disk1 disk2) (ontopofpeg disk3 peg3) (ontopofpeg disk1 peg2)
   added: (ontopofpeg disk2 peg2) (ontopofpeg disk1 peg3) (ondisk disk1 disk3)
   goals met: 2 of 8
6. (movefromemptytowertodisk disk2 disk4 peg2 peg1)
   deleted: (isbottom disk2 peg2) (ontopofpeg disk2 peg2) (ontopofpeg disk4 peg1)
   added: (ontopofpeg disk2 peg1) (ispegfree peg2) (ondisk disk2 disk4)
   goals met: 3 of 8
7. (movefromdiskonemptytower disk1 disk3 peg3 peg2)
   deleted: (ispegfree peg2) (ondisk disk1 disk3) (ontopofpeg disk1 peg3)
   added: (ontopofpeg disk3 peg3) (isbottom disk1 peg2) (ontopofpeg disk1 peg2)
   goals met: 1 of 8
8. (movefromdiskondisk disk2 disk4 disk3 peg1 peg3)
   deleted: (ondisk disk2 disk4) (ontopofpeg disk3 peg3) (ontopofpeg disk2 peg1)
   added: (ontopofpeg disk4 peg1) (ontopofpeg disk2 peg3) (ondisk disk2 disk3)
   goals met: 2 of 8
9. (movefromemptytowertodisk disk1 disk2 peg2 peg3)
   deleted: (isbottom disk1 peg2) (ontopofpeg disk1 peg2) (ontopofpeg disk2 peg3)
   added: (ontopofpeg disk1 peg3) (ispegfree peg2) (ondisk disk1 disk2)
   goals met: 5 of 8
10. (movefromdiskonemptytower disk4 disk5 peg1 peg2)
   deleted: (ispegfree peg2) (ondisk disk4 disk5) (ontopofpeg disk4 peg1)
   added: (ontopofpeg disk5 peg1) (isbottom disk4 peg2) (ontopofpeg disk4 peg2)
   goals met: 3 of 8
11. (movefromdiskondisk disk1 disk2 disk4 peg3 peg2)
   deleted: (ondisk disk1 disk2) (ontopofpeg disk4 peg2) (ontopofpeg disk1 peg3)
   added: (ontopofpeg disk2 peg3) (ontopofpeg disk1 peg2) (ondisk disk1 disk4)
   goals met: 1 of 8
12. (movefromdiskondisk disk2 disk3 disk5 peg3 peg1)
   deleted: (ondisk disk2 disk3) (ontopofpeg disk5 peg1) (ontopofpeg disk2 peg3)
   added: (ontopofpeg disk3 peg3) (ontopofpeg disk2 peg1) (ondisk disk2 disk5)
   goals met: 0 of 8
13. (movefromdiskondisk disk1 disk4 disk2 peg2 peg1)
   deleted: (ondisk disk1 disk4) (ontopofpeg disk2 peg1) (ontopofpeg disk1 peg2)
   added: (ontopofpeg disk4 peg2) (ontopofpeg disk1 peg1) (ondisk disk1 disk2)
   goals met: 1 of 8
14. (movefromemptytowertodisk disk3 disk4 peg3 peg2)
   deleted: (isbottom disk3 peg3) (ontopofpeg disk3 peg3) (ontopofpeg disk4 peg2)
   added: (ontopofpeg disk3 peg2) (ispegfree peg3) (ondisk disk3 disk4)
   goals met: 2 of 8
15. (movefromdiskonemptytower disk1 disk2 peg1 peg3)
   deleted: (ispegfree peg3) (ondisk disk1 disk2) (ontopofpeg disk1 peg1)
   added: (ontopofpeg disk2 peg1) (isbottom disk1 peg3) (ontopofpeg disk1 peg3)
   goals met: 2 of 8
16. (movefromdiskondisk disk2 disk5 disk3 peg1 peg2)
   deleted: (ondisk disk2 disk5) (ontopofpeg disk3 peg2) (ontopofpeg disk2 peg1)
   added: (ontopofpeg disk5 peg1) (ontopofpeg disk2 peg2) (ondisk disk2 disk3)
   goals met: 3 of 8
17. (movefromemptytowertodisk disk1 disk2 peg3 peg2)
   deleted: (isbottom disk1 peg3) (ontopofpeg disk1 peg3) (ontopofpeg disk2 peg2)
   added: (ontopofpeg disk1 peg2) (ispegfree peg3) (ondisk disk1 disk2)
   goals met: 3 of 8
18. (movefromemptytoweronemptytower disk5 peg1 peg3)
   deleted: (ispegfree peg3) (isbottom disk5 peg1) (ontopofpeg disk5 peg1)
   added: (ispegfree peg1) (isbottom disk5 peg3) (ontopofpeg disk5 peg3)
   goals met: 5 of 8
19. (movefromdiskondisk disk1 disk2 disk5 peg2 peg3)
   deleted: (ondisk disk1 disk2) (ontopofpeg disk5 peg3) (ontopofpeg disk1 peg2)
   added: (ontopofpeg disk2 peg2) (ontopofpeg disk1 peg3) (ondisk disk1 disk5)
   goals met: 5 of 8
20. (movefromdiskonemptytower disk2 disk3 peg2 peg1)
   deleted: (ispegfree peg1) (ondisk disk2 disk3) (ontopofpeg disk2 peg2)
   added: (ontopofpeg disk3 peg2) (isbottom disk2 peg1) (ontopofpeg disk2 peg1)
   goals met: 3 of 8
21. (movefromdiskondisk disk1 disk5 disk3 peg3 peg2)
   deleted: (ondisk disk1 disk5) (ontopofpeg disk3 peg2) (ontopofpeg disk1 peg3)
   added: (ontopofpeg disk5 peg3) (ontopofpeg disk1 peg2) (ondisk disk1 disk3)
   goals met: 2 of 8
22. (movefromemptytowertodisk disk2 disk5 peg1 peg3)
   deleted: (isbottom disk2 peg1) (ontopofpeg disk2 peg1) (ontopofpeg disk5 peg3)
   added: (ontopofpeg disk2 peg3) (ispegfree peg1) (ondisk disk2 disk5)
   goals met: 3 of 8
23. (movefromdiskondisk disk1 disk3 disk2 peg2 peg3)
   deleted: (ondisk disk1 disk3) (ontopofpeg disk2 peg3) (ontopofpeg disk1 peg2)
   added: (ontopofpeg disk3 peg2) (ontopofpeg disk1 peg3) (ondisk disk1 disk2)
   goals met: 5 of 8
24. (movefromdiskonemptytower disk3 disk4 peg2 peg1)
   deleted: (ispegfree peg1) (ondisk disk3 disk4) (ontopofpeg disk3 peg2)
   added: (ontopofpeg disk4 peg2) (isbottom disk3 peg1) (ontopofpeg disk3 peg1)
   goals met: 3 of 8
25. (movefromdiskondisk disk1 disk2 disk4 peg3 peg2)
   deleted: (ondisk disk1 disk2) (ontopofpeg disk4 peg2) (ontopofpeg disk1 peg3)
   added: (ontopofpeg disk2 peg3) (ontopofpeg disk1 peg2) (ondisk disk1 disk4)
   goals met: 1 of 8
26. (movefromdiskondisk disk2 disk5 disk3 peg3 peg1)
   deleted: (ondisk disk2 disk5) (ontopofpeg disk3 peg1) (ontopofpeg disk2 peg3)
   added: (ontopofpeg disk5 peg3) (ontopofpeg disk2 peg1) (ondisk disk2 disk3)
   goals met: 2 of 8
27. (movefromdiskondisk disk1 disk4 disk2 peg2 peg1)
   deleted: (ondisk disk1 disk4) (ontopofpeg disk2 peg1) (ontopofpeg disk1 peg2)
   added: (ontopofpeg disk4 peg2) (ontopofpeg disk1 peg1) (ondisk disk1 disk2)
   goals met: 3 of 8
28. (movefromemptytowertodisk disk4 disk5 peg2 peg3)
   deleted: (isbottom disk4 peg2) (ontopofpeg disk4 peg2) (ontopofpeg disk5 peg3)
   added: (ontopofpeg disk4 peg3) (ispegfree peg2) (ondisk disk4 disk5)
   goals met: 5 of 8
29. (movefromdiskonemptytower disk1 disk2 peg1 peg2)
   deleted: (ispegfree peg2) (ondisk disk1 disk2) (ontopofpeg disk1 peg1)
   added: (ontopofpeg disk2 peg1) (isbottom disk1 peg2) (ontopofpeg disk1 peg2)
   goals met: 3 of 8
30. (movefromdiskondisk disk2 disk3 disk4 peg1 peg3)
   deleted: (ondisk disk2 disk3) (ontopofpeg disk4 peg3) (ontopofpeg disk2 peg1)
   added: (ontopofpeg disk3 peg1) (ontopofpeg disk2 peg3) (ondisk disk2 disk4)
   goals met: 2 of 8
31. (movefromemptytowertodisk disk1 disk2 peg2 peg3)
   deleted: (isbottom disk1 peg2) (ontopofpeg disk1 peg2) (ontopofpeg disk2 peg3)
   added: (ontopofpeg disk1 peg3) (ispegfree peg2) (ondisk disk1 disk2)
   goals met: 5 of 8
32. (movefromemptytoweronemptytower disk3 peg1 peg2)
   deleted: (ispegfree peg2) (isbottom disk3 peg1) (ontopofpeg disk3 peg1)
   added: (ispegfree peg1) (isbottom disk3 peg2) (ontopofpeg disk3 peg2)
   goals met: 5 of 8
33. (movefromdiskonemptytower disk1 disk2 peg3 peg1)
   deleted: (ispegfree peg1) (ondisk disk1 disk2) (ontopofpeg disk1 peg3)
   added: (ontopofpeg disk2 peg3) (isbottom disk1 peg1) (ontopofpeg disk1 peg1)
   goals met: 2 of 8
34. (movefromdiskondisk disk2 disk4 disk3 peg3 peg2)
   deleted: (ondisk disk2 disk4) (ontopofpeg disk3 peg2) (ontopofpeg disk2 peg3)
   added: (ontopofpeg disk4 peg3) (ontopofpeg disk2 peg2) (ondisk disk2 disk3)
   goals met: 3 of 8
35. (movefromemptytowertodisk disk1 disk4 peg1 peg3)
   deleted: (isbottom disk1 peg1) (ontopofpeg disk1 peg1) (ontopofpeg disk4 peg3)
   added: (ontopofpeg disk1 peg3) (ispegfree peg1) (ondisk disk1 disk4)
   goals met: 5 of 8
36. (movefromdiskonemptytower disk2 disk3 peg2 peg1)
   deleted: (ispegfree peg1) (ondisk disk2 disk3) (ontopofpeg disk2 peg2)
   added: (ontopofpeg disk3 peg2) (isbottom disk2 peg1) (ontopofpeg disk2 peg1)
   goals met: 3 of 8
37. (movefromdiskondisk disk1 disk4 disk2 peg3 peg1)
   deleted: (ondisk disk1 disk4) (ontopofpeg disk2 peg1) (ontopofpeg disk1 peg3)
   added: (ontopofpeg disk4 peg3) (ontopofpeg disk1 peg1) (ondisk disk1 disk2)
   goals met: 3 of 8
38. (movefromemptytowertodisk disk3 disk4 peg2 peg3)
   deleted: (isbottom disk3 peg2) (ontopofpeg disk3 peg2) (ontopofpeg disk4 peg3)
   added: (ontopofpeg disk3 peg3) (ispegfree peg2) (ondisk disk3 disk4)
   goals met: 5 of 8
39. (movefromdiskonemptytower disk1 disk2 peg1 peg2)
   deleted: (ispegfree peg2) (ondisk disk1 disk2) (ontopofpeg disk1 peg1)
   added: (ontopofpeg disk2 peg1) (isbottom disk1 peg2) (ontopofpeg disk1 peg2)
   goals met: 3 of 8
40. (movefromemptytowertodisk disk2 disk3 peg1 peg3)
   deleted: (isbottom disk2 peg1) (ontopofpeg disk2 peg1) (ontopofpeg disk3 peg3)
   added: (ontopofpeg disk2 peg3) (ispegfree peg1) (ondisk disk2 disk3)
   goals met: 5 of 8
41. (movefromemptytowertodisk disk1 disk2 peg2 peg3)
   deleted: (isbottom disk1 peg2) (ontopofpeg disk1 peg2) (ontopofpeg disk2 peg3)
   added: (ontopofpeg disk1 peg3) (ispegfree peg2) (ondisk disk1 disk2)
   goals met: 8 of 8
